### 2 задание

# Общее описание

В этом задании вам предстоит провести A/B тест на процессе оформления кредитных карт. Алгоритм решения задачи следующий.

  1. Клонировать в Colab ноутбук - шаблон ответа (один на две задачи в проекте).
  2. Напишите боту @TFDataAnalysisBot команду /get_project2_desc. Так вы получите условие и файл с историческими данными.
  3. Определите целевую метрику (= какой-то из колонок) и альтернативу.
  4. Определите параметр, влияющий на целевую метрику.
  5. Исходя из исторических данных, определите минимальный размер n одной выборки.
  6. Напишите боту команду /get_project2_sample n, где n - полученный в пункте 4 минимальный размер выборки.
  7. Проверьте однородность выборок по выбранному в пункте 4 параметру.
  8. Если выборки неоднородны, то тест провален. Если выборки однородны, примените критерий для целевой метрики.
  9. Опишите ваши выводы по тесту.

# Описание данных

Процесс оформления кредитной карты (КК) устроен следующим образом:

  1. человек заходит на сайт и заполняет информацию о себе (в том числе возраст и доход клиента) для получения кредитной карты;
  2. человек проходит скоринг (в том числе в рамках которого оценивается вероятность банкротства клиента);
  3. создаётся заявка на оформление кредитной карты;
  4. человеку выпускается виртуальная карта, а также предлагается наша услуга к этому счёту; 
  5. с некоторой вероятностью человек утилизирует счёт (начинает им пользоваться);
  6. если человек не утилизирует счёт, мы несём некоторые затраты на время оператора и поддержку инфраструктуры;
  7. если человек утилизировал карту, мы имеем некоторый заработок (PV) и повышенные расходы.

# Описание колонок в исторических данных.

  - ID - номер заявки, прошедшей скоринг
  - Возраст - возраст клиента, указанный при оформлении КК
  - Доход клиента - доход клиента, указанный при оформлении КК
  - Вероятность банкротства - оценка вероятности банкротства клиента, полученная с помощью скоринга по параметрам клиента
  - Флаг утилизация счёта - совершение первой расходной операции на счёте КК
  - Расходы - сумма затрат на заявку
  - PV КК - 0 если счёт не утилизирован, иначе = PV кредитной карты
  - PV услуги - 0 если счёт не утилизирован, иначе = PV этой услуги
  - NPV = PV КК + PV услуги - Расходы
